d_hopper/static_case/Hopper_Original/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPiso;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         120.0;

deltaT          0.000015;

writeControl    adjustableRunTime;

writeInterval   0.3;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.001;

maxDeltaT       1;

functions
{
    meanVelocityProbes
    {
        type            probes;
        functionObjectLibs ( "libsampling.so" );
        outputControl   0.0005;
        outputInterval  1;
        probeLocations
        (
            (   -0.005   0.0   0.0   )
(   -0.00466666666667   -0.00166666666667   0.0   )
(   -0.00466666666667   -0.00133333333333   0.0   )
(   -0.00466666666667   -0.001   0.0   )
(   -0.00466666666667   -0.000666666666667   0.0   )
(   -0.00466666666667   -0.000333333333333   0.0   )
(   -0.00466666666667   0.0   0.0   )
(   -0.00466666666667   0.000333333333333   0.0   )
(   -0.00466666666667   0.000666666666667   0.0   )
(   -0.00466666666667   0.001   0.0   )
(   -0.00466666666667   0.00133333333333   0.0   )
(   -0.00466666666667   0.00166666666667   0.0   )
(   -0.00433333333333   -0.00233333333333   0.0   )
(   -0.00433333333333   -0.002   0.0   )
(   -0.00433333333333   -0.00166666666667   0.0   )
(   -0.00433333333333   -0.00133333333333   0.0   )
(   -0.00433333333333   -0.001   0.0   )
(   -0.00433333333333   -0.000666666666667   0.0   )
(   -0.00433333333333   -0.000333333333333   0.0   )
(   -0.00433333333333   0.0   0.0   )
(   -0.00433333333333   0.000333333333333   0.0   )
(   -0.00433333333333   0.000666666666667   0.0   )
(   -0.00433333333333   0.001   0.0   )
(   -0.00433333333333   0.00133333333333   0.0   )
(   -0.00433333333333   0.00166666666667   0.0   )
(   -0.00433333333333   0.002   0.0   )
(   -0.00433333333333   0.00233333333333   0.0   )
(   -0.004   -0.003   0.0   )
(   -0.004   -0.00266666666667   0.0   )
(   -0.004   -0.00233333333333   0.0   )
(   -0.004   -0.002   0.0   )
(   -0.004   -0.00166666666667   0.0   )
(   -0.004   -0.00133333333333   0.0   )
(   -0.004   -0.001   0.0   )
(   -0.004   -0.000666666666667   0.0   )
(   -0.004   -0.000333333333333   0.0   )
(   -0.004   0.0   0.0   )
(   -0.004   0.000333333333333   0.0   )
(   -0.004   0.000666666666667   0.0   )
(   -0.004   0.001   0.0   )
(   -0.004   0.00133333333333   0.0   )
(   -0.004   0.00166666666667   0.0   )
(   -0.004   0.002   0.0   )
(   -0.004   0.00233333333333   0.0   )
(   -0.004   0.00266666666667   0.0   )
(   -0.004   0.003   0.0   )
(   -0.00366666666667   -0.00333333333333   0.0   )
(   -0.00366666666667   -0.003   0.0   )
(   -0.00366666666667   -0.00266666666667   0.0   )
(   -0.00366666666667   -0.00233333333333   0.0   )
(   -0.00366666666667   -0.002   0.0   )
(   -0.00366666666667   -0.00166666666667   0.0   )
(   -0.00366666666667   -0.00133333333333   0.0   )
(   -0.00366666666667   -0.001   0.0   )
(   -0.00366666666667   -0.000666666666667   0.0   )
(   -0.00366666666667   -0.000333333333333   0.0   )
(   -0.00366666666667   0.0   0.0   )
(   -0.00366666666667   0.000333333333333   0.0   )
(   -0.00366666666667   0.000666666666667   0.0   )
(   -0.00366666666667   0.001   0.0   )
(   -0.00366666666667   0.00133333333333   0.0   )
(   -0.00366666666667   0.00166666666667   0.0   )
(   -0.00366666666667   0.002   0.0   )
(   -0.00366666666667   0.00233333333333   0.0   )
(   -0.00366666666667   0.00266666666667   0.0   )
(   -0.00366666666667   0.003   0.0   )
(   -0.00366666666667   0.00333333333333   0.0   )
(   -0.00333333333333   -0.00366666666667   0.0   )
(   -0.00333333333333   -0.00333333333333   0.0   )
(   -0.00333333333333   -0.003   0.0   )
(   -0.00333333333333   -0.00266666666667   0.0   )
(   -0.00333333333333   -0.00233333333333   0.0   )
(   -0.00333333333333   -0.002   0.0   )
(   -0.00333333333333   -0.00166666666667   0.0   )
(   -0.00333333333333   -0.00133333333333   0.0   )
(   -0.00333333333333   -0.001   0.0   )
(   -0.00333333333333   -0.000666666666667   0.0   )
(   -0.00333333333333   -0.000333333333333   0.0   )
(   -0.00333333333333   0.0   0.0   )
(   -0.00333333333333   0.000333333333333   0.0   )
(   -0.00333333333333   0.000666666666667   0.0   )
(   -0.00333333333333   0.001   0.0   )
(   -0.00333333333333   0.00133333333333   0.0   )
(   -0.00333333333333   0.00166666666667   0.0   )
(   -0.00333333333333   0.002   0.0   )
(   -0.00333333333333   0.00233333333333   0.0   )
(   -0.00333333333333   0.00266666666667   0.0   )
(   -0.00333333333333   0.003   0.0   )
(   -0.00333333333333   0.00333333333333   0.0   )
(   -0.00333333333333   0.00366666666667   0.0   )
(   -0.003   -0.004   0.0   )
(   -0.003   -0.00366666666667   0.0   )
(   -0.003   -0.00333333333333   0.0   )
(   -0.003   -0.003   0.0   )
(   -0.003   -0.00266666666667   0.0   )
(   -0.003   -0.00233333333333   0.0   )
(   -0.003   -0.002   0.0   )
(   -0.003   -0.00166666666667   0.0   )
(   -0.003   -0.00133333333333   0.0   )
...
(   0.005   0.0   0.0   )

        );
        fields
        (
            U
        );
    }

// ************************************************************************* //
