d_hopper/static_case/Hopper_Original/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walla
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       1012116;
    }
    wallb
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       1015316;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9600;
        startFace       1018516;
    }
    hopper
    {
        type            wall;
        inGroups        1(wall);
        nFaces          71236;
        startFace       1028116;
    }
)

// ************************************************************************* //
