d_hopper/static_case/Hopper_Original/CFD/0/Ksl
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ksl;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -3 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    "(walla|wallb|walls|hopper)"
    {
        type            zeroGradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
