d_hopper/static_case/Hopper_Original/CFD/0/f
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      f;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -2 -2 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    "(walla|wallb|walls|hopper)"
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
