d_hopper/static_case/Hopper_Original/CFD/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    walla
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallb
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    hopper
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
